craigsblackie/mpk-mini-ad07-research/esp32-c3-ble-midi/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# This is a peripheral only; the scanning roles cost flash and RAM.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
# Keep bonds across power cycles: the bridge is powered by the keyboard, so it
# reboots every time the MPK is unplugged. Without this the host must re-pair.
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# Headroom for aggregated notifications; the default 12 blocks is tight when a
# SysEx dump and live playing overlap.
CONFIG_BT_NIMBLE_MSYS1_BLOCK_COUNT=24
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
